tap "caskroom/cask"
tap "drone/drone"
tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/portable-ruby"
tap "homebrew/services"
tap "microsoft/mssql-release"
tap "minio/stable"
tap "mongodb/brew"
tap "sambadevi/powerlevel9k"
# Search tool like grep, but optimized for programmers
brew "ack"
# Multi-Model NoSQL Database
brew "arangodb"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Sed-like editor for binary files
brew "bbe"
# Freely available high-quality data compressor
brew "bzip2"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# File comparison utilities
brew "diffutils"
# Trace a chain of DNS servers to the source
brew "dnstracer"
# Generate documentation for several programming languages
brew "doxygen"
# Distributed search & analytics engine
brew "elasticsearch", restart_service: true
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU implementation of which utility
brew "gnu-which"
# Generic library support script
brew "libtool"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Database migrations CLI tool
brew "golang-migrate"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open-source distributed event streaming platform
brew "kafka", restart_service: true
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# NaCl networking and cryptography library
brew "libsodium"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# C virtualization API
brew "libvirt"
# YAML Parser
brew "libyaml"
# File compressor
brew "lzop"
# Utility for directing compilation
brew "make"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql", restart_service: true
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Platform built on V8 to build network applications
brew "node", link: false
# Modern shell for the GitHub era
brew "nushell"
# Utility which converts PDF files into HTML and XML formats
brew "pdftohtml"
# Object-relational database system
brew "postgresql@10", restart_service: true
# Object-relational database system
brew "postgresql@9.6", restart_service: true
# Secure and efficient FTP server
brew "pure-ftpd"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Traffic generator for the SIP protocol
brew "sipp"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Analyze tcpdump output
brew "tcptrace"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Secure FTP server for UNIX
brew "vsftpd", restart_service: true
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark", link: false
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# High-performance, asynchronous messaging library
brew "zeromq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
brew "drone/drone/drone"
# SSL/TLS cryptography library
brew "homebrew/portable-ruby/portable-openssl"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# High Performance Object Storage compatible with Amazon S3 API
brew "minio/stable/minio"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
cask "font-hack-nerd-font"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Command-line shell and scripting language
cask "powershell"
# Command-line shell and scripting language
cask "powershell-preview"
# Development environment
cask "vagrant"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
